import { SuperMarketCategoriesI } from "../../types/scrape/scraping.types";

export const MILK_AND_EGGS_CATEGORY = [
  "חלב תנובה",
  "חלב תנובה 1%",
  "חלב סויה",
  "חלב שיבולת שועל",
  "גבינה צהובה עמק",
  "ביצים m ",
  "ביצים l",
  "גבינה לבנה 5% תנ",
  "קוטג 5% תנ",
  "מילקי שוקולד",
  "יוגורט פרו 20 ",
];

export const FRUITS_AND_VEGETABLES_CATEGORY = [
  "עגבניה",
  "מלפפון",
  "בצל יבש",
  "אבטיח",
  "פלפל חריף",
  "מלון",
  "לימון",
  "תפוח אדמה לבן",
  "תפוח עץ",
  "חסה",
  "עגבניות שרי משקל",
  "מארז שום",
  "כרוב לבן",
];

const SWEETS_CATEGORY = [
  "קליק חום לבן",
  "נוטלה 750 גר",
  "מרשמלו ורוד לבן כרמית 150 גר",
  "שוקולד פרה חלב מעולה",
  "קינדר שוקולד 200 גר",
  "הפי היפו",
  "פררו רושה",
  "בונבוניירה שוקולד מרסי",
  "טופיפי",
  "קליק ביסקוויט",
];

const DRINKS_CATEGORY = [
  "פריגת תות בננה",
  "קוקה קולה בקבוק 1.5",
  "פריגת ענבים",
  "אלוורה מלון",
  "קוקה קולה זירו 1.5 ליטר",
  "נביעות+ בטעם ענבים",
  "שוופס מוגז עדין אננס",
  "פאנטה אורנג",
  "פפסי קולה 1.5",
  "פריגת מנגו",
  "ספרינג אפרסק",
  "גאמפ ענבים",
];

const MEAST_AND_FISH_CATEGORY = [
  "שניצל עוף טרי",
  "שוקיים עוף טרי",
  "סטייק פרגית",
  "בשר טחון טרי",
  "אנטריקוט טרי",
  "נתח פילה סלמון קפוא",
  "פילה אמנון קפוא",
  "אסאדו ללא עצם",
  "כנפיים עוף טרי",
];

const FROZENS_CATEGORY = [
  "חטיפי פיצה גבינה",
  "חטיפי פיצה זיתים",
  "אפונה מוקפאת",
  "שעועית ירוקה שלמה",
  "טבעות בצל",
  "צ'יפס אמריקאי",
  "גלידונית",
  "סיגרים בשר",
  "סיגרים תפוח אדמה",
  "קובה בשר",
  "בצק פילו",
  "בצק פילו שלושת האופים",
  "מלאווח",
  "ג'חנון",
  "בן אנד ג'ריס וניל",
];

const YOHANANOF_CATEGORIES: SuperMarketCategoriesI = {
  MILK_AND_EGGS_CATEGORY,
  FRUITS_AND_VEGETABLES_CATEGORY,
  SWEETS_CATEGORY,
  DRINKS_CATEGORY,
  MEAST_AND_FISH_CATEGORY,
  FROZENS_CATEGORY,
};

export default YOHANANOF_CATEGORIES;
